### 创建  dataframe 

  dataframe({'列名1':series1,'列名2':series2})

  规则 series 里有索引则对齐 无则填NAN

#### dataframe取列 数据

  1,dataframe.列名 (此方法容易混淆datafrme自带的属性名,不建议常用)

  2,dataframe['列名']

  3,dataframe[['列1','列2']]  取多列

#### dataframe 取行

  1,索引使用 dataframe.loc['索引'] or dataframe.iloc['下标']

  2,切片 也支持切片操作 如:索引1到索引5

    如返回的是一条结果 就是series对象 ,若是多条结果返回的是dataframe对象

  3,花哨索引 dataframe.iloc[[1,2,4]] 取出第二三五行数据

  4,掩码 dataframe.loc[dataframe['数据1']>90] 找出dataframe里数据1列所有大于90数据

  5,定位取单值 dataframe.loc['索引1','列1']

  6,二维切片 dataframe.loc['索引1':'索引2','列名1':'列名2']

  7,组合切片 掩码 花式索引等 dataframe.loc[掩码,[列名1,列名2]]

  8,iloc与loc 功能一直,区别在于iloc使用下标做为索引,loc使用索引名做索引

#### dataframe.values 转化为numpy 的ndarry数据

### 创建 dataframe

In [1]:
import pandas as pd
import numpy as np
df1=pd.DataFrame({'列名1':np.random.randint(0,10,5),'列名2':np.random.randint(0,2,5)})
df1

   列名1  列名2
0    7    1
1    6    1
2    6    0
3    4    1
4    4    1

In [4]:
type(df1.loc[2,'列名1'])

numpy.int32

In [14]:
sr1=df1['列名1']
sr1=sr1[sr1>3]
sr1

0    4
4    8
Name: 列名1, dtype: int32

In [15]:
sr2=df1['列名2']
sr2

0    0
1    0
2    0
3    0
4    1
Name: 列名2, dtype: int32

### 创建dataframe 规则 series 里有索引则对齐 无则填NAN

In [17]:
df2=pd.DataFrame({'列1':sr1,'列2':sr2})
df2

    列1  列2
0  4.0   0
1  NaN   0
2  NaN   0
3  NaN   0
4  8.0   1

### df取列值

In [19]:
df1.列名1

0    4
1    3
2    3
3    2
4    8
Name: 列名1, dtype: int32

In [21]:
df1['列名1']

0    4
1    3
2    3
3    2
4    8
Name: 列名1, dtype: int32

In [22]:
df1[['列名1','列名2']]

   列名1  列名2
0    4    0
1    3    0
2    3    0
3    2    0
4    8    1

### dataframe 取行

In [24]:
df1.loc[0]

列名1    4
列名2    0
Name: 0, dtype: int32

In [25]:
df1.iloc[0]

列名1    4
列名2    0
Name: 0, dtype: int32

In [27]:
df1.iloc[0:2]

   列名1  列名2
0    4    0
1    3    0

In [28]:
df1.iloc[[1,2,4]]

   列名1  列名2
1    3    0
2    3    0
4    8    1

### 掩码

In [34]:
df1.loc[df1['列名1']>3]

   列名1  列名2
0    4    0
4    8    1

### 定位取单值

In [38]:
df1.loc[4,'列名1'] #先索引名  再列名

8

### 二维切片

In [10]:
df1.loc[0,:]

列名1    4
列名2    1
Name: 0, dtype: int32

In [2]:
df1.loc[0:2,['列名1','列名2']]

   列名1  列名2
0    4    1
1    0    1
2    1    0

In [42]:
df1.loc[df1['列名1']<4,['列名1','列名2']]

   列名1  列名2
1    3    0
2    3    0
3    2    0

### df转化为ndarry

In [43]:
df1.values

array([[4, 0],
       [3, 0],
       [3, 0],
       [2, 0],
       [8, 1]])